Revit 2027 API
BuiltInFailures.LevelAssociationFailures.AllLevelsDeleted Property
 All Levels from model were deleted
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AllLevelsDeleted { get; }
Public Shared ReadOnly Property AllLevelsDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AllLevelsDeleted {
	FailureDefinitionId^ get ();
}
static member AllLevelsDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LevelAssociationFailures Class
Autodesk.Revit.DB Namespace